{
    "fields": [
        {
            "constraints": {
                "required": false
            },
            "description": "The allocation agency identifies the department or agency that is receiving funds through an allocation (non-expenditure) transfer.",
            "name": "AllocationTransferAgencyIdentifier",
            "title": "Allocation Transfer Agency Identifier",
            "type": "string"
        },
        {
            "constraints": {
                "required": false
            },
            "description": "The agency code identifies the department or agency that is responsible for the account.",
            "name": "AgencyIdentifier",
            "title": "Agency Identifier",
            "type": "string"
        },
        {
            "constraints": {
                "maximum": 2100,
                "minimum": 1900,
                "required": false
            },
            "description": "In annual and multi-year funds, the beginning period of availability identifies the first year of availability under law that an appropriation account may incur new obligations.",
            "name": "BeginningPeriodOfAvailability",
            "title": "Beginning Period Of Availability",
            "type": "number"
        },
        {
            "constraints": {
                "maximum": 2100,
                "minimum": 1900,
                "required": false
            },
            "description": "In annual and multi-year funds, the end period of availability identifies the last year of funds availability under law that an appropriation account may incur new obligations.",
            "name": "EndingPeriodOfAvailability",
            "title": "Ending Period Of Availability",
            "type": "number"
        },
        {
            "constraints": {
                "enum": [
                    "X"
                ],
                "required": false
            },
            "description": "In appropriations accounts, the availability type code identifies an unlimited period to incur new obligations; this is denoted by the letter 'X'",
            "name": "AvailabilityTypeCode",
            "title": "Availability Type Code",
            "type": "string"
        },
        {
            "constraints": {
                "required": false
            },
            "description": "The main account code identifies the account in statute.",
            "name": "MainAccountCode",
            "title": "Main Account Code",
            "type": "string"
        },
        {
            "constraints": {
                "required": false
            },
            "description": "The identifier of an action being reported that indicates the specific subsequent change to the initial award.",
            "name": "AwardModAmendmentNumber",
            "title": "Award Modification Amendment Number",
            "type": "number"
        },
        {
            "constraints": {
                "required": false
            },
            "description": "The prefix of the prime award indicating the Activity Address Code which is the department/agency and office issuing the instrument.  Use the AAC assigned to the program/funding office providing  the predominance of funding for the contract action as the program/funding office code.",
            "name": "ParentAwardIDPrefix",
            "title": "Parent Award ID Prefix",
            "type": "string"
        },
        {
            "constraints": {
                "maximum": 99,
                "minimum": 0,
                "required": false
            },
            "description": "The last two digits of the fiscal year in which the procurement instrument  is issued or awarded. This is the date the action is signed, not the effective date if the effective date is different.",
            "name": "ParentAwardYear",
            "title": "Parent Award Year",
            "type": "number"
        },
        {
            "constraints": {
                "pattern": "[A-Z]",
                "required": false
            },
            "description": "The type of instrument by entering one upper case letter in position nine of the PIID. Departments and independent agencies may assign those letters identified for department use in accordance with their agency policy; however, any use must be applied to the entire department or agency.",
            "name": "ParentAwardType",
            "title": "Parent Award Type",
            "type": "string"
        },
        {
            "constraints": {
                "required": false
            },
            "description": "The identifier of the procurement award under which the specific award is issued (such as a Federal Supply Schedule). Term currently applies to procurement actions only.\n\nThe number assigned by the issuing agency in these positions. Agencies may choose a minimum of four characters up to a maximum of eight characters to be used, but the same number of characters must be used agency-wide. If a number less than the maximum is used, do not use leading or trailing zeroes to make it equal the maximum in any system or data transmission. A separate series of numbers may be used for any type of instrument listed in paragraph (a)(3) of this section. An agency may reserve blocks of numbers or alpha-numeric numbers for use by its various components.",
            "name": "ParentAwardNumber",
            "title": "Parent Award Number",
            "type": "string"
        },
        {
            "constraints": {
                "required": true
            },
            "description": "The Federal Award Identification Number (FAIN) is the unique ID within the Federal agency for each financial assistance award.  Once an agency assigns a FAIN and reports it to USAspending.gov, the Federal agency may not- with limited exceptions modify the FAIN during the life of the award. Further, once a Federal agency assigns a FAIN, that Federal agency must ensure that the FAIN is clearly identified in all Federal award documents. As a term and condition of the award, Federal agencies must require that all recipients document the assigned FAIN on each subaward under the Federal award.",
            "name": "FainAwardNumber",
            "title": "FAIN Award Number",
            "type": "string"
        },
        {
            "constraints": {
                "required": true
            },
            "description": "Categories in a classification system that presents obligations by the items or services purchased by the Federal Government. Each specific object class is defined in OMB Circular A-11 83.6.\n(defined in OMB Circular A-11)",
            "name": "ObjectClass",
            "title": "Object Class",
            "type": "string"
        },
        {
            "constraints": {
                "minimum": 0,
                "required": true
            },
            "description": "Obligation means a legally binding agreement that will result in outlays, immediately or in the future. When you place an order, sign a contract, award a grant, purchase a service, or take other actions that require the Government to make payments to the public or from one Government account to another, you incur an obligation. It is a violation of the Antideficiency Act (31 U.S.C. 1341(a)) to involve the Federal Government in a contract or obligation for payment of money before an appropriation is made, unless authorized by law. This means you cannot incur obligations in a vacuum; you incur an obligation against budget authority in a Treasury account that belongs to your agency. It is a violation of the Antideficiency Act to incur an obligation in an amount greater than the amount available in the Treasury account that is available. This means that the account must have budget authority sufficient to cover the total of such obligations at the time the obligation is incurred. In addition, the obligation you incur must conform to other applicable provisions of law, and you must be able to support the amounts reported by the documentary evidence required by 31 U.S.C. 1501. Moreover, you are required to maintain certifications and records showing that the amounts have been obligated (31 U.S.C. 1108). The following subsections provide additional guidance on when to record obligations for the different types of goods and services or the amount.\n\nAdditional detail is provided in Circular A-11.",
            "format": "currency",
            "name": "TransactionObligatedAmount",
            "title": "Transaction Obligated Amount",
            "type": "number"
        }
    ]
}